Revit 2026 API

# PrintSetupSave Method

---

Save the changes for the current print setting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Save()
```
```vb
Public Function Save As Boolean
```
```cpp
public:
bool Save()
```
```fsharp
member Save : unit -> bool
```

#### Return Value

BooleanFalse if save operation fails, otherwise True.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the current print setting is In-Session or the current print setting has not changed. |

#### Reference

PrintSetup Class

Autodesk.Revit.DB Namespace